Revit 2027 API
NavisworksExportOptions.GetSelectedElementIds Method
 Returns the element ids of the elements to export. Empty by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetSelectedElementIds()
Public Function GetSelectedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetSelectedElementIds()
member GetSelectedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace